/* ============================================================ */
/* ファイル名 : pf_raysens_if.c                                 */
/* 機能       : HW I/F処理                                      */
/* ============================================================ */
#define SECTION_PF

/* ============================================================ */
/* インクルード                                                 */
/* ============================================================ */
/* プロジェクト共通 */
#include "prj_cmn_section.h"
#include "prj_cmn_option.h"
#include "prj_cmn_type.h"
#include "prj_cmn_macro.h"

/* カテゴリ共通 */
#include "pf_cmn_option.h"
#include "pf_cmn_option_pac.h"

/* 個別 */
#include "pf_bat_if_pac.h"
#include "pf_switch_if_pac.h"
#include "pf_raysens_if_pac.h"
#include "pf_mtr_if_pac.h"
#include "pf_led_if_pac.h"
#include "pf_bz_if_pac.h"

/* 本体 */
#include "pf_if_hw_pac.h"


/* ============================================================ */
/* マクロ定数定義                                               */
/* ============================================================ */


/* ============================================================ */
/* 型定義                                                       */
/* ============================================================ */


/* ============================================================ */
/* 関数プロトタイプ宣言(static)                                 */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(extern)                                             */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(static)                                             */
/* ============================================================ */


/* ============================================================ */
/* const変数定義(extern)                                        */
/* ============================================================ */


/* ============================================================ */
/* const変数定義(static)                                        */
/* ============================================================ */


/* ============================================================ */
/* 関数形式マクロ定義                                           */
/* ============================================================ */


/* ============================================================ */
/* 関数定義                                                     */
/* ============================================================ */
/* ============================================================ */
/* 関数名 : FnVD_PfIf_Hw_init                                   */
/*          HW I/F 初期化                                       */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : ハードウェア層の初期化を行う                        */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfIf_Hw_init(VD)
{
  /* 光学センサ初期化 */
  FnVD_PfRaySens_If_initHw();

  /* LED初期化 */
  FnVD_PfLed_If_initHw();

  /* ブザー初期化 */
  FnVD_PfBz_If_initHw();

  /* モータ初期化 */
  FnVD_PfMtr_If_initHw();

  /* バッテリー初期化 */
  FnVD_PfBat_If_initHw();

  /* スイッチ入力処理初期化 */
  FnVD_PfSwt_If_initHw();
}


/* ============================================================ */
/* 関数名 : FnVD_PfIf_Hw_input                                  */
/*          HW I/F 入力処理                                     */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : ハードウェア層からの入力データを取得する            */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfIf_Hw_input(VD)
{
  /* スイッチ入力信号(生値)更新 */
  FnVD_PfSwt_If_renewSignalRaw();
}


/* ============================================================ */
/* 関数名 : FnVD_PfIf_Hw_Output                                 */
/*          HW I/F 出力処理                                     */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : ハードウェア層への出力を指示する                    */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfIf_Hw_output(VD)
{
  /* ToDo:LED点灯処理を仮実装 */
  FnVD_PfLed_If_setReqLed();

  /* バッテリー電圧監視用LED処理 */
  FnVD_PfBat_If_setReqLed0();
  FnVD_PfBat_If_setReqLed1();

  /* ブザー吹鳴処理 */
  FnVD_PfBz_If_setReq();
}


/* ============================================================ */
/* 関数名 : FnVD_PfIf_Hw_inputForInt                            */
/*          HW I/F 入力処理(割り込み処理用)                     */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : ハードウェア層からの入力データを取得する            */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfIf_Hw_inputForInt(VD)
{
  /* センサ値更新 */
  FnVD_PfRaySens_If_renewVal();

  /* モータパルス数更新 */
  FnVD_PfMtr_If_renewPulseCntr();

  /* バッテリー電圧値取得処理 */
  /* Note:センサ値と同じチャネルグループでA/D変換を行うため同じタスクで実行する必要あり */
  FnVD_PfBat_If_renewVal();
}


/* ============================================================ */
/* 関数名 : FnVD_PfIf_Hw_outputForInt                           */
/*          HW I/F 出力処理(割り込み処理用)                     */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : ハードウェア層への出力を指示する                    */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfIf_Hw_outputForInt(VD)
{
  /* モータ出力処理 */
  FnVD_PfMtr_If_setReq();
}

