/* ============================================================ */
/* ファイル名 : pf_led_if.c                                     */
/* 機能       : LED I/F処理                                     */
/* ============================================================ */
#define SECTION_PF

/* ============================================================ */
/* インクルード                                                 */
/* ============================================================ */
/* プロジェクト共通 */
#include "prj_cmn_section.h"
#include "prj_cmn_option.h"
#include "prj_cmn_type.h"
#include "prj_cmn_macro.h"

/* カテゴリ共通 */
#include "pf_cmn_option.h"
#include "pf_cmn_option_pac.h"

/* 個別 */
#include "hw_drv_led.h"
#include "pf_led_ctrl_pac.h"

/* 本体 */
#include "pf_led_if_pac.h"


/* ============================================================ */
/* マクロ定数定義                                               */
/* ============================================================ */


/* ============================================================ */
/* 型定義                                                       */
/* ============================================================ */


/* ============================================================ */
/* 関数プロトタイプ宣言(static)                                 */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(extern)                                             */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(static)                                             */
/* ============================================================ */


/* ============================================================ */
/* const変数定義(extern)                                        */
/* ============================================================ */


/* ============================================================ */
/* const変数定義(static)                                        */
/* ============================================================ */


/* ============================================================ */
/* 関数形式マクロ定義                                           */
/* ============================================================ */


/* ============================================================ */
/* 関数定義                                                     */
/* ============================================================ */
/* ============================================================ */
/* 関数名 : FnVD_PfLed_If_initHw                                */
/*          LED I/F処理初期化(HW用)                             */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : ハードウェア層の初期化を行う                        */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfLed_If_initHw(VD)
{
  FnVD_HwDrv_Led_init();
}


/* ============================================================ */
/* 関数名 : FnVD_PfLed_If_setReqLed                             */
/*          LED消灯/点灯要求設定                                */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : LEDを点灯/消灯させる                                */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfLed_If_setReqLed(VD)
{
  U1 tu1ReqLed0;
  U1 tu1ReqLed1;
  U1 tu1ReqLed2;
  U1 tu1ReqLed3;

  /* 点灯/消灯要求出力値取得 */
  tu1ReqLed0 = FnU1_PfLed_Ctrl_getReqLed0();
  tu1ReqLed1 = FnU1_PfLed_Ctrl_getReqLed1();
  tu1ReqLed2 = FnU1_PfLed_Ctrl_getReqLed2();
  tu1ReqLed3 = FnU1_PfLed_Ctrl_getReqLed3();

  /* 出力要求設定 */
  FnVD_HwDrv_Led_setReqLed(tu1ReqLed0, tu1ReqLed1, tu1ReqLed2, tu1ReqLed3);
}


/* ============================================================ */
/* 関数名 : FnVD_PfLed_If_setReqLed0                            */
/*          LED0消灯/点灯要求設定                               */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : LED0を点灯/消灯させる                               */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfLed_If_setReqLed0(VD)
{
  U1 tu1ReqLed;

  /* 点灯/消灯要求出力値取得 */
  tu1ReqLed = FnU1_PfLed_Ctrl_getReqLed0();

  /* 出力要求設定 */
  FnVD_HwDrv_Led_setReqLed0(tu1ReqLed);
}


/* ============================================================ */
/* 関数名 : FnVD_PfLed_If_setReqLed1                            */
/*          LED1消灯/点灯要求設定                               */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : LED1を点灯/消灯させる                               */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfLed_If_setReqLed1(VD)
{
  U1 tu1ReqLed;

  /* 点灯/消灯要求出力値取得 */
  tu1ReqLed = FnU1_PfLed_Ctrl_getReqLed1();

  /* 出力要求設定 */
  FnVD_HwDrv_Led_setReqLed1(tu1ReqLed);
}


/* ============================================================ */
/* 関数名 : FnVD_PfLed_If_setReqLed2                            */
/*          LED2消灯/点灯要求設定                               */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : LED2を点灯/消灯させる                               */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfLed_If_setReqLed2(VD)
{
  U1 tu1ReqLed;

  /* 点灯/消灯要求出力値取得 */
  tu1ReqLed = FnU1_PfLed_Ctrl_getReqLed2();

  /* 出力要求設定 */
  FnVD_HwDrv_Led_setReqLed2(tu1ReqLed);
}


/* ============================================================ */
/* 関数名 : FnVD_PfLed_If_setReqLed3                            */
/*          LED3消灯/点灯要求設定                               */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : LED3を点灯/消灯させる                               */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfLed_If_setReqLed3(VD)
{
  U1 tu1ReqLed;

  /* 点灯/消灯要求出力値取得 */
  tu1ReqLed = FnU1_PfLed_Ctrl_getReqLed3();

  /* 出力要求設定 */
  FnVD_HwDrv_Led_setReqLed3(tu1ReqLed);
}

