/* ============================================================ */
/* ファイル名 : pf_switch_if.c                                  */
/* 機能       : スイッチ入力処理                                */
/* ============================================================ */
#define SECTION_PF

/* ============================================================ */
/* インクルード                                                 */
/* ============================================================ */
/* プロジェクト共通 */
#include "prj_cmn_section.h"
#include "prj_cmn_option.h"
#include "prj_cmn_type.h"
#include "prj_cmn_macro.h"

/* カテゴリ共通 */
#include "pf_cmn_option.h"
#include "pf_cmn_option_pac.h"

/* 個別 */
#include "hw_drv_switch.h"

/* 本体 */
#include "pf_switch_if_pac.h"


/* ============================================================ */
/* マクロ定数定義                                               */
/* ============================================================ */


/* ============================================================ */
/* 型定義                                                       */
/* ============================================================ */


/* ============================================================ */
/* 関数プロトタイプ宣言(static)                                 */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(extern)                                             */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(static)                                             */
/* ============================================================ */
/* スイッチ信号(生値) */
static F1 f1PfSwt_If_SignalRaw;

/* 右側スイッチ(生値) */
#define fPfSwt_If_TactSwtRightRaw   f1PfSwt_If_SignalRaw.Flag.fBit0

/* 中央スイッチ(生値) */
#define fPfSwt_If_TactSwtCenterRaw  f1PfSwt_If_SignalRaw.Flag.fBit1

/* 左側スイッチ(生値) */
#define fPfSwt_If_TactSwtLeftRaw    f1PfSwt_If_SignalRaw.Flag.fBit2


/* ============================================================ */
/* const変数定義(extern)                                        */
/* ============================================================ */


/* ============================================================ */
/* const変数定義(static)                                        */
/* ============================================================ */


/* ============================================================ */
/* 関数形式マクロ定義                                           */
/* ============================================================ */


/* ============================================================ */
/* 関数定義                                                     */
/* ============================================================ */
/* ============================================================ */
/* 関数名 : FnVD_PfSwt_If_initHw                                */
/*          スイッチ入力処理初期化(HW用)                        */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : ハードウェア層の初期化を行う                        */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfSwt_If_initHw(VD)
{
  FnVD_HwDrv_Swt_init();
}


/* ============================================================ */
/* 関数名 : FnVD_PfSwt_If_initPf                                */
/*          スイッチ入力処理初期化(PF用)                        */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : スイッチ入力処理の初期化を行う                      */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfSwt_If_initPf(VD)
{
  /* Memo:fPfSwt_If_TactSwtRightRawの初期化を兼ねる */
  /* Memo:fPfSwt_If_TactSwtCenterRawの初期化を兼ねる */
  /* Memo:fPfSwt_If_TactSwtLeftRawの初期化を兼ねる */
  f1PfSwt_If_SignalRaw.u1Val  = (U1)0x00;
}


/* ============================================================ */
/* 関数名 : FnVD_PfSwt_If_renewSignalRaw                        */
/*          スイッチ信号(生値)更新                              */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : スイッチ信号(生値)を更新する                        */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfSwt_If_renewSignalRaw(VD)
{
  /* 右側タクトスイッチ信号(生値) */
  fPfSwt_If_TactSwtRightRaw  = FnU1_HwDrv_Swt_getTactSwtRightSignal();

  /* 中央タクトスイッチ信号(生値) */
  fPfSwt_If_TactSwtCenterRaw = FnU1_HwDrv_Swt_getTactSwtCenterSignal();

  /* 左側タクトスイッチ信号(生値) */
  fPfSwt_If_TactSwtLeftRaw   = FnU1_HwDrv_Swt_getTactSwtLeftSignal();

}


/* ============================================================ */
/* 関数名 : FnU1_PfSwt_If_getTactSwtRightRaw                    */
/*          右側タクトスイッチ信号(生値)取得                    */
/* 引数   : なし                                                */
/* 戻り値 : 右側タクトスイッチ信号(生値) (0:OFF, 1:ON)          */
/* 概要   : 右側タクトスイッチ信号(生値)を提供する              */
/* 制約   : なし                                                */
/* ============================================================ */
U1 FnU1_PfSwt_If_getTactSwtRightRaw(VD)
{
  return (fPfSwt_If_TactSwtRightRaw);
}


/* ============================================================ */
/* 関数名 : FnU1_PfSwt_If_getTactSwtCenterRaw                   */
/*          中央タクトスイッチ信号(生値)取得                    */
/* 引数   : なし                                                */
/* 戻り値 : 中央タクトスイッチ信号(生値) (0:OFF, 1:ON)          */
/* 概要   : 中央タクトスイッチ信号(生値)を提供する              */
/* 制約   : なし                                                */
/* ============================================================ */
U1 FnU1_PfSwt_If_getTactSwtCenterRaw(VD)
{
  return (fPfSwt_If_TactSwtCenterRaw);
}


/* ============================================================ */
/* 関数名 : FnU1_PfSwt_If_getTactSwtLeftRaw                     */
/*          左側タクトスイッチ信号(生値)取得                    */
/* 引数   : なし                                                */
/* 戻り値 : 左側タクトスイッチ信号(生値) (0:OFF, 1:ON)          */
/* 概要   : 左側タクトスイッチ信号(生値)を提供する              */
/* 制約   : なし                                                */
/* ============================================================ */
U1 FnU1_PfSwt_If_getTactSwtLeftRaw(VD)
{
  return (fPfSwt_If_TactSwtLeftRaw);
}


