/* ============================================================ */
/* ファイル名 : xx_yyy_zzzz.c                                   */
/* 機能       :                                                 */
/* ============================================================ */
#define SECTION_XX

/* ============================================================ */
/* インクルード                                                 */
/* ============================================================ */
/* プロジェクト共通 */
#include "prj_cmn_section.h"
#include "prj_cmn_option.h"
#include "prj_cmn_type.h"
#include "prj_cmn_macro.h"

/* カテゴリ共通 */
#include "pf_cmn_option.h"
#include "pf_cmn_option_pac.h"

/* 個別 */
#include "app_controll.h"
#include "hw_drv_wheel.h"

/* 本体 */
#include "pf_control_if.h"
#include "pf_control_if_pac.h"


/* ============================================================ */
/* マクロ定数定義                                               */
/* ============================================================ */


/* ============================================================ */
/* 型定義                                                       */
/* ============================================================ */


/* ============================================================ */
/* 関数プロトタイプ宣言(static)                                 */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(extern)                                             */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(static)                                             */
/* ============================================================ */


/* ============================================================ */
/* const変数定義(extern)                                        */
/* ============================================================ */


/* ============================================================ */
/* const変数定義(static)                                        */
/* ============================================================ */


/* ============================================================ */
/* 関数形式マクロ定義                                           */
/* ============================================================ */


/* ============================================================ */
/* 関数定義                                                     */
/* ============================================================ */
/* ============================================================ */
/* 関数名 : vd_g_InitializeLoControl                            */
/*          初期化処理                                          */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : モジュールで使用する変数の初期化を行う              */
/* 制約   : メイン処理実行前にコールすること                    */
/* ============================================================ */
void vd_g_InitializeLoControl(void)
{
    /* NOP */
}

/* ============================================================ */
/* 関数名 : FnVD_XxYyy_defineFormat                             */
/*          走行制御(1ms割り込み)                               */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : 加減速処理と姿勢制御を行う                          */
/* 制約   : コール条件：CMT0割り込み                            */
/*          センサ情報取得済みであること                        */
/* ============================================================ */
void vd_g_IntLoControl1MSTask(void)
{
    U2 u2_t_cycle_time_r;
    U2 u2_t_cycle_time_l;

    /* APPからデータ取得 */
    u2_t_cycle_time_r = u2_g_get_CycleTimeR();
    u2_t_cycle_time_l = u2_g_get_CycleTimeL();

    /* HWへデータ渡し */
    vd_g_set_WheelCycleTimeR(u2_t_cycle_time_r);
    vd_g_set_WheelCycleTimeL(u2_t_cycle_time_l);
}

/* ============================================================ */
/* 関数名 : vd_g_LoControlTask                                  */
/*          走行制御                                            */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : 走行制御を行う                                      */
/* 制約   : コール条件：プランナの命令が確定していること        */
/* ============================================================ */
void vd_g_LoControlTask(void)
{
    S1 s1_t_mtr_mode_r;
    S1 s1_t_mtr_mode_l;
    U1 u1_t_mtr_power;

    /* APPからデータ取得 */
    s1_t_mtr_mode_r = s1_g_get_MtrModeR();
    s1_t_mtr_mode_l = s1_g_get_MtrModeL();
    u1_t_mtr_power = u1_g_get_MtrPowerMode();

    /* HWへデータ渡し */
    vd_g_set_WheelMtrModeR(s1_t_mtr_mode_r);
    vd_g_set_WheelMtrModeL(s1_t_mtr_mode_l);
    vd_g_set_WheelMtrPower(u1_t_mtr_power);
}

