/* ============================================================ */
/* ファイル名 : hw_pph_adc_cfg.c                                */
/* 機能       : A/D変換処理用ユーザ設定                         */
/* ============================================================ */
#define SECTION_HW

/* ============================================================ */
/* インクルード                                                 */
/* ============================================================ */
/* プロジェクト共通 */
#include "prj_cmn_section.h"
#include "prj_cmn_option.h"
#include "prj_cmn_type.h"
#include "prj_cmn_macro.h"

/* カテゴリ共通 */
#include "hw_cmn_option.h"
#include "hw_cmn_option_pac.h"

/* 個別 */

/* 本体 */
#include "hw_pph_adc_pac.h"
#include "hw_pph_adc_cfg_pac.h"


/* ============================================================ */
/* マクロ定数定義                                               */
/* ============================================================ */


/* ============================================================ */
/* 型定義                                                       */
/* ============================================================ */


/* ============================================================ */
/* 関数プロトタイプ宣言(static)                                 */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(extern)                                             */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(static)                                             */
/* ============================================================ */


/* ============================================================ */
/* const変数定義(extern)                                        */
/* ============================================================ */
/* ----------------- */
/* ADCSRレジスタ設定 */
/* ----------------- */
/* トリガ設定(ADCSR.EXTRG) */
/* Memo:ソフトウェアトリガーを使用するため未実装 */

/* トリガ開始許可設定(ADCSR.TRGE) */
/* Memo:ソフトウェアトリガーを使用するため未実装 */

/* A/D変換クロック設定(ADCSR.CKS) */
const EN_HwPph_Adc_SelClk CEN_HwPph_Adc_CfgSelClk_ = CEN_HwPph_Adc_CfgSelClk;

/* スキャン終了割り込み許可(ADCSR.ADIE) */ /* S12ADI0割り込み */
const U1 CU1_HwPph_Adc_CfgIntEnb_ = CU1_HwPph_Adc_CfgIntEnb;

/* スキャンモード設定(ADCSR.ADCS) */
/* Memo:シングルスキャンモードを使用するため未実装 */

/* -------------------- */
/* ADADS0,1レジスタ設定 */
/* -------------------- */
/* Memo:加算モードを使用しないため未実装 */

/* ----------------- */
/* ADADCレジスタ設定 */
/* ----------------- */
/* Memo:加算モードを使用しないため未実装 */

/* ----------------- */
/* ADCERレジスタ設定 */
/* ----------------- */
/* 自動クリアイネーブル設定(ADCER.ACE) */
const U1 CU1_HwPph_Adc_CfgReadClrEnb_ = CU1_HwPph_Adc_CfgReadClrEnb;

/* A/Dデータレジスタフォーマット設定(ADCER.ADRFMT) */
const EN_HwPph_Adc_Format CEN_HwPph_Adc_CfgFormat_ = CEN_HwPph_Adc_CfgFormat;

/* ------------------- */
/* ADSTRGRレジスタ設定 */
/* ------------------- */
/* Memo:ソフトウェアトリガーを使用するため未実装 */

/* ------------------- */
/* ADEXICRレジスタ設定 */
/* ------------------- */
/* Memo:温度センサ/内部基準電圧を使用しないため未実装 */

/* ------------------- */
/* ADEXICRレジスタ設定 */
/* ------------------- */
/* Memo:温度センサ/内部基準電圧を使用しないため未実装 */

/* -------------------- */
/* ADSSTR01レジスタ設定 */
/* -------------------- */
/* サンプリング時間1設定(ADSSTR01.SST1) */  /* Note:設定範囲は20から255までであること */
const U1 CU1_HwPph_Adc_CfgSamplingTime_ = (U1)McXX_grdMin((U2)CU1_HwPph_Adc_CfgSamplingTime, CU2_HwPph_Adc_ADSSTR01_SST1_Min);

/* -------------------- */
/* ADSSTR23レジスタ設定 */
/* -------------------- */
/* Memo:温度センサを使用しないため未実装 */


/* ============================================================ */
/* const変数定義(static)                                        */
/* ============================================================ */


/* ============================================================ */
/* 関数形式マクロ定義                                           */
/* ============================================================ */


/* ============================================================ */
/* 関数定義                                                     */
/* ============================================================ */
