/* ============================================================ */
/* ファイル名 : pf_mtr_if.c                                     */
/* 機能       : モータ I/F処理                                  */
/* ============================================================ */
#define SECTION_PF

/* ============================================================ */
/* インクルード                                                 */
/* ============================================================ */
/* プロジェクト共通 */
#include "prj_cmn_section.h"
#include "prj_cmn_option.h"
#include "prj_cmn_type.h"
#include "prj_cmn_macro.h"

/* カテゴリ共通 */
#include "pf_cmn_option.h"
#include "pf_cmn_option_pac.h"

/* 個別 */
#include "hw_drv_mtr.h"

/* 本体 */
#include "pf_mtr_if_pac.h"


/* ============================================================ */
/* マクロ定数定義                                               */
/* ============================================================ */


/* ============================================================ */
/* 型定義                                                       */
/* ============================================================ */


/* ============================================================ */
/* 関数プロトタイプ宣言(static)                                 */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(extern)                                             */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(static)                                             */
/* ============================================================ */


/* ============================================================ */
/* const変数定義(extern)                                        */
/* ============================================================ */


/* ============================================================ */
/* const変数定義(static)                                        */
/* ============================================================ */


/* ============================================================ */
/* 関数形式マクロ定義                                           */
/* ============================================================ */


/* ============================================================ */
/* 関数定義                                                     */
/* ============================================================ */
/* ============================================================ */
/* 関数名 : FnVD_PfMtr_If_initHw                                */
/*          モータ I/F処理初期化(HW用)                          */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : ハードウェア層の初期化を行う                        */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfMtr_If_initHw(VD)
{
  FnVD_HwDrv_Mtr_init();
}


/* ============================================================ */
/* 関数名 : FnVD_PfMtr_If_setReq                                */
/*          モータ出力要求設定                                  */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : モータを出力する                                    */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfMtr_If_setReq(VD)
{
  U2 tu2PeriodR;
  U2 tu2OnTimeR;
  U2 tu2PeriodL;
  U2 tu2OnTimeL;
  U1 tu1RotDirPortR;
  U1 tu1RotDirPortL;
  U1 tu1Enb;

#if 1
  /* ToDo:暫定処置 */
  tu1Enb = (U1)C_OFF;
  tu1RotDirPortR = (U1)C_OFF;
  tu1RotDirPortL = (U1)C_OFF;
  tu2PeriodR = (U2)48000;
  tu2OnTimeR = (U2)47940;
  tu2PeriodL = (U2)48000;
  tu2OnTimeL = (U2)47940;
#endif

  /* モータ出力許可設定 */
  FnVD_HwDrv_Mtr_setEnbPort(tu1Enb);

  /* モータ回転方向設定 */
  FnVD_HwDrv_Mtr_setRotDirPortBoth(tu1RotDirPortR, tu1RotDirPortL);

  /* モータPWM設定 */
  FnVD_HwDrv_Mtr_setPulseWidthBoth(tu2PeriodR, tu2OnTimeR, tu2PeriodL, tu2OnTimeL);

  /* モータ制御開始 */
  FnVD_HwDrv_Mtr_ctrlStpAndGoBoth(tu1Enb, tu1Enb);
}


/* ============================================================ */
/* 関数名 : FnVD_PfMtr_If_clrPulseCntr                          */
/*          モータパルス数クリア                                */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : モータパルス数をクリアする                          */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfMtr_If_clrPulseCntr(VD)
{
  FnVD_HwDrv_Mtr_clrPulseCntr();
}


/* ============================================================ */
/* 関数名 : FnVD_PfMtr_If_getPulseCntr                          */
/*          モータパルス数取得                                  */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : モータパルス数を更新する                            */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfMtr_If_getPulseCntr(U2 * tpu2PulseRight, U2 * tpu2PulseLeft)
{
  FnVD_HwDrv_Mtr_getPulseCntr(tpu2PulseRight, tpu2PulseLeft);
}

