/* ============================================================ */
/* ファイル名 : pf_mtr_if.c                                     */
/* 機能       : モータI/F処理                                   */
/* ============================================================ */
#define SECTION_PF

/* ============================================================ */
/* インクルード                                                 */
/* ============================================================ */
/* プロジェクト共通 */
#include "prj_cmn_section.h"
#include "prj_cmn_option.h"
#include "prj_cmn_type.h"
#include "prj_cmn_macro.h"

/* カテゴリ共通 */
#include "pf_cmn_option.h"
#include "pf_cmn_option_pac.h"

/* 個別 */
#include "hw_drv_mtr.h"

/* 本体 */
#include "pf_mtr_if_pac.h"

/* #define OP_PfMtr_If_Test */
#if defined(OP_PfMtr_If_Test)
  /* ToDo:テスト用のため最終的には削除する */
  #include "pf_switch_ctrl_pac.h"
#endif


/* ============================================================ */
/* マクロ定数定義                                               */
/* ============================================================ */


/* ============================================================ */
/* 型定義                                                       */
/* ============================================================ */


/* ============================================================ */
/* 関数プロトタイプ宣言(static)                                 */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(extern)                                             */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(static)                                             */
/* ============================================================ */
/* [回]モータパルス数 */
static U2 u2PfMtr_If_PulseCountRight;
static U2 u2PfMtr_If_PulseCountLeft;


/* ============================================================ */
/* const変数定義(extern)                                        */
/* ============================================================ */


/* ============================================================ */
/* const変数定義(static)                                        */
/* ============================================================ */


/* ============================================================ */
/* 関数形式マクロ定義                                           */
/* ============================================================ */


/* ============================================================ */
/* 関数定義                                                     */
/* ============================================================ */
/* ============================================================ */
/* 関数名 : FnVD_PfMtr_If_initHw                                */
/*          モータI/F処理初期化(HW用)                           */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : ハードウェア層の初期化を行う                        */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfMtr_If_initHw(VD)
{
  FnVD_HwDrv_Mtr_init();
}


/* ============================================================ */
/* 関数名 : FnVD_PfMtr_If_initPf                                */
/*          モータI/F処理初期化(PF用)                           */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : モータI/F処理の初期化を行う                         */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfMtr_If_initPf(VD)
{
  /* モータパルス数初期化 */
  u2PfMtr_If_PulseCountRight = (U2)0;
  u2PfMtr_If_PulseCountLeft  = (U2)0;
}


/* ============================================================ */
/* 関数名 : FnVD_PfMtr_If_setReq                                */
/*          モータ出力要求設定                                  */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : モータを出力する                                    */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfMtr_If_setReq(VD)
{
  U2 tu2PeriodR;
  U2 tu2OnTimeR;
  U2 tu2PeriodL;
  U2 tu2OnTimeL;
  U1 tu1RotDirPortR;
  U1 tu1RotDirPortL;
  U1 tu1Enb;

#if (1)
  /* ToDo:暫定処置 */
  tu1Enb = (U1)C_OFF;
  tu1RotDirPortR = (U1)C_OFF;
  tu1RotDirPortL = (U1)C_OFF;
  tu2PeriodR = (U2)16000;
  tu2OnTimeR = (U2)15980;
  tu2PeriodL = (U2)16000;
  tu2OnTimeL = (U2)15980;
#endif
#if defined(OP_PfMtr_If_Test)
  /* ToDo:テスト用のため最終的には削除する */
  /* 中央タクトスイッチ瞬時値(2度読み)ONで始動, OFFで停止 */ */
  tu1Enb = FnU1_PfSwt_Ctrl_getTactSwtCenterMomentary();

  /* 左右タクトスイッチ短押しONで逆転、OFFで正転 */
  tu1RotDirPortR = FnU1_PfSwt_Ctrl_getTactSwtRightShortPush();
  tu1RotDirPortL = FnU1_PfSwt_Ctrl_getTactSwtLeftShortPush();
#endif

  /* モータ出力許可設定 */
  FnVD_HwDrv_Mtr_setEnbPort(tu1Enb);

  /* モータ回転方向設定 */
  FnVD_HwDrv_Mtr_setRotDirPortBoth(tu1RotDirPortR, tu1RotDirPortL);

  /* モータPWM設定 */
  FnVD_HwDrv_Mtr_setPulseWidthBoth(tu2PeriodR, tu2OnTimeR, tu2PeriodL, tu2OnTimeL);

  /* モータ制御開始 */
  FnVD_HwDrv_Mtr_ctrlStpAndGoBoth(tu1Enb, tu1Enb);
}


/* ============================================================ */
/* 関数名 : FnVD_PfMtr_If_clrPulseCntr                          */
/*          モータパルス数クリア                                */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : モータパルス数をクリアする                          */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfMtr_If_clrPulseCntr(VD)
{
  FnVD_HwDrv_Mtr_clrPulseCntr();
}


/* ============================================================ */
/* 関数名 : FnVD_PfMtr_If_renewPulseCntr                        */
/*          モータパルス数更新                                  */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : モータパルス数を更新する                            */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfMtr_If_renewPulseCntr(VD)
{
  FnVD_HwDrv_Mtr_getPulseCntr(&u2PfMtr_If_PulseCountRight, &u2PfMtr_If_PulseCountLeft);
}


/* ============================================================ */
/* 関数名 : FnU2_PfMtr_If_getPulseCountRight                    */
/*          右モータパルス数取得                                */
/* 引数   : なし                                                */
/* 戻り値 : [回]右モータパルス数(LSB:1回)                       */
/* 概要   : 右モータパルス数を提供する                          */
/* 制約   : なし                                                */
/* ============================================================ */
U2 FnU2_PfMtr_If_getPulseCountRight(VD)
{
  return (u2PfMtr_If_PulseCountRight);
}


/* ============================================================ */
/* 関数名 : FnU2_PfMtr_If_getPulseCountLeft                     */
/*          左モータパルス数取得                                */
/* 引数   : なし                                                */
/* 戻り値 : [回]左モータパルス数(LSB:1回)                       */
/* 概要   : 左モータパルス数を提供する                          */
/* 制約   : なし                                                */
/* ============================================================ */
U2 FnU2_PfMtr_If_getPulseCountLeft(VD)
{
  return (u2PfMtr_If_PulseCountLeft);
}

