/* ============================================================ */
/* ファイル名 : pf_bat_monitor.c                                */
/* 機能       : バッテリー監視                                  */
/* ============================================================ */
#define SECTION_PF

/* ============================================================ */
/* インクルード                                                 */
/* ============================================================ */
/* プロジェクト共通 */
#include "prj_cmn_section.h"
#include "prj_cmn_option.h"
#include "prj_cmn_type.h"
#include "prj_cmn_macro.h"

/* カテゴリ共通 */
#include "pf_cmn_option.h"
#include "pf_cmn_option_pac.h"

/* 個別 */
#include "pf_bat_if_pac.h"

/* 本体 */
#include "pf_bat_monitor_pac.h"


/* ============================================================ */
/* マクロ定数定義                                               */
/* ============================================================ */
/* バッテリー電圧最小値:10V */ /* ToDo:物理値 / LSBの表現としたい(LSB不明) */
#define CU2_PfBat_Moni_VolatageMin          ((U2)2034)

/* バッテリー電圧最大値:12.4V */ /* ToDo:物理値 / LSBの表現としたい(LSB不明) */
#define CU2_PfBat_Moni_VolatageMax          ((U2)2552)

/* [ms]バッテリー電圧低下検出時間 */
#define CU1_PfBat_Moni_JdgVolatageLowTim    ((U1)((U1)50 / CU1_PrjCmn_MainPeriod))


/* ============================================================ */
/* 型定義                                                       */
/* ============================================================ */


/* ============================================================ */
/* 関数プロトタイプ宣言(static)                                 */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(extern)                                             */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(static)                                             */
/* ============================================================ */
/* バッテリー電圧低下検出時間タイマー */
static U1 u1PfBat_Moni_VolatageLowTimer;

/* バッテリー監視ステータス */
static F1 f1PfBat_Moni_Sts;

/* バッテリー電圧低下 */
#define fPfBat_Moni_StsVolatageLow    f1PfBat_Moni_Sts.Flag.fBit0


/* ============================================================ */
/* const変数定義(extern)                                        */
/* ============================================================ */


/* ============================================================ */
/* const変数定義(static)                                        */
/* ============================================================ */


/* ============================================================ */
/* 関数形式マクロ定義                                           */
/* ============================================================ */


/* ============================================================ */
/* 関数定義                                                     */
/* ============================================================ */
/* ============================================================ */
/* 関数名 : FnVD_PfBat_Moni_init                                */
/*          バッテリー監視処理初期化                            */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : バッテリー監視処理の初期化を行う                    */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfBat_Moni_init(VD)
{
  u1PfBat_Moni_VolatageLowTimer = (U1)0;

  /* Memo:fPfBat_Moni_StsVolatageLowの初期化も兼ねる */
  f1PfBat_Moni_Sts.u1Val = (U1)0x00;
}


/* ============================================================ */
/* 関数名 : FnVD_PfBat_Moni_jdgVoltageLow                       */
/*          バッテリー電圧低下判定                              */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : バッテリー電圧値を更新する                          */
/* 制約   : なし                                                */
/* ============================================================ */
VD FnVD_PfBat_Moni_jdgVoltageLow(VD)
{
  U2 tu2Val;

  /* バッテリー電圧値取得 */
  tu2Val = FnU2_PfBat_If_getVal();

  /* バッテリー電圧低下判定 */
  if (tu2Val < CU2_PfBat_Moni_VolatageMin) {
    McXX_incU1Max(u1PfBat_Moni_VolatageLowTimer);
  }
  else {
    u1PfBat_Moni_VolatageLowTimer = (U1)0;
  }

  /* バッテリー電圧低下検出/復帰 */
  if (u1PfBat_Moni_VolatageLowTimer > CU1_PfBat_Moni_JdgVolatageLowTim) {
    fPfBat_Moni_StsVolatageLow = (U1)C_ON;
  }
  else {
    /* 電源OFFまで復帰しない */
  }
}


/* ============================================================ */
/* 関数名 : FnU1_PfBat_Moni_getStsVoltageLow                    */
/*          バッテリー電圧低下状態取得                          */
/* 引数   : なし                                                */
/* 戻り値 : バッテリー電圧低下状態                              */
/* 概要   : バッテリー電圧低下状態を提供する                    */
/* 制約   : なし                                                */
/* ============================================================ */
U1 FnU1_PfBat_Moni_getStsVoltageLow(VD)
{
  return (fPfBat_Moni_StsVolatageLow);
}

