/* ============================================================ */
/* ファイル名 : hw_core_junction.c                              */
/* 機能       : ブート層とユーザプログラム層の接合部            */
/* ============================================================ */
#define SECTION_HW

/* ============================================================ */
/* インクルード                                                 */
/* ============================================================ */
/* プロジェクト共通 */
#include "prj_cmn_section.h"
#include "prj_cmn_option.h"
#include "prj_cmn_type.h"
#include "prj_cmn_macro.h"

/* カテゴリ共通 */
#include "hw_cmn_option.h"
#include "hw_cmn_option_pac.h"

/* 個別 */
#include "hw_srv_schedule_pac.h"
#include "hw_srv_interrupt.h"
#include "hw_pph_port_pac.h"
#include "hw_pph_intctrl_pac.h"
#include "hw_core_termination_pac.h"

/* 本体 */
#include "hw_core_junction_pac.h"


/* ============================================================ */
/* マクロ定数定義                                               */
/* ============================================================ */


/* ============================================================ */
/* 型定義                                                       */
/* ============================================================ */


/* ============================================================ */
/* 関数プロトタイプ宣言(static)                                 */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(extern)                                             */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(static)                                             */
/* ============================================================ */


/* ============================================================ */
/* const変数定義(extern)                                        */
/* ============================================================ */


/* ============================================================ */
/* const変数定義(static)                                        */
/* ============================================================ */


/* ============================================================ */
/* 関数形式マクロ定義                                           */
/* ============================================================ */


/* ============================================================ */
/* スタックサイズ指定                                           */
/* ============================================================ */


/* ============================================================ */
/* 関数定義                                                     */
/* ============================================================ */

/* このセクションへは関数は２つ以上配置しないこと */
/* 現状は関数アドレスを固定化する必要性なし */
#pragma section P PROG_JUNC0
/* ============================================================ */
/* 関数名 : FnVD_HwCore_Junction_shiftUserProgram               */
/*          ユーザープログラム移行                              */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : スタートアップ処理とユーザープログラムへ移行        */
/* 制約   : 割り込み禁止区間であること                          */
/*          この関数で割り込み禁止が解除される                  */
/* ============================================================ */
VD FnVD_HwCore_Junction_shiftUserProgram(VD)
{ 
  /* ポート初期化(スタートアップ用) */
  FnVD_HwPph_Port_initForStartup();

  /* 割り込み制御初期化(スタートアップ用) */
  FnVD_HwPph_IntCtrl_initForStartup();

  /* ユーザプログラム初期化処理 */
  FnVD_HwSrv_wrapInitProc();

  /* 割り込み許可 */
  EI();

  /* ユーザプログラムへ移行(無限ループで戻らない) */
  FnVD_HwSrv_wrapMainProc();

  /* 戻らない想定だが念のため停止処理を行う */
  FnVD_HwCore_Termination_kill((U4)0x0000FFFF);
}
/* セクションをユーザー定義に戻す */
#include "prj_cmn_section.h"

