#if !defined(INCLUDED_pf_cmn_option_pac_h)
#define INCLUDED_pf_cmn_option_pac_h
/* ================================================== */
/* ファイル名 : pf_cmn_option_pac.h                   */
/* 機能       : PFオプション定義                      */
/* ================================================== */

/* ================================================== */
/* インクルード                                       */
/* ================================================== */
#include "prj_cmn_option.h"
#include "pf_cmn_option.h"

/* ================================================== */
/* オプション定義                                     */
/* ================================================== */
/* イニシャルLED点灯チェック */
#define OP_PfCmn_ExistFuncInitialLedChk

/* イニシャルブザー吹鳴チェック */
/* #define OP_PfCmn_ExistFuncInitialBzChk */


/* ================================================== */
/* 評価用オプション定義                               */
/* ================================================== */
#include "pf_cmn_option_eva_pac.h"


/* ================================================== */
/* オプションチェック                                 */
/* ================================================== */
#include "pf_cmn_chk_option_pac.h"

#endif
