#if !defined(INCLUDED_app_plan_mode_pac_h)
#define INCLUDED_app_plan_mode_pac_h
/* ============================================================ */
/* ファイル名 : app_plan_mode_pac.h                             */
/* 機能       :                                                 */
/* ============================================================ */

/* ============================================================ */
/* インクルード                                                 */
/* ============================================================ */
/* プロジェクト共通 */
#include "prj_cmn_option.h"
#include "prj_cmn_type.h"
#include "prj_cmn_macro.h"

/* カテゴリ共通 */
#include "app_cmn_option.h"
#include "app_cmn_option_pac.h"

/* 個別 */
#include "pf_switch_ctrl.h"

/* 本体 */


/* ============================================================ */
/* マクロ定数定義                                               */
/* ============================================================ */


/* ============================================================ */
/* 型定義                                                       */
/* ============================================================ */
/* 走行モードを示す列挙型 */
typedef enum {
  CEN_AppPln_Mode_StsReady = 0,    /* 準備モード */
  CEN_AppPln_Mode_StsSearch,       /* 探索モード */
  CEN_AppPln_Mode_StsStay,         /* 待機モード */
  CEN_AppPln_Mode_StsTimeAttack,   /* 計測モード */
  CEN_AppPln_Mode_StsFinish,       /* 完了モード */
  CEN_AppPln_Mode_StsNum
} EN_AppPln_Mode_Sts;


/* ============================================================ */
/* 関数プロトタイプ宣言(extern)                                 */
/* ============================================================ */
extern VD FnVD_AppPln_Mode_init(VD);
extern VD FnVD_AppPln_Mode_jdgTransition(VD);
extern EN_AppPln_Mode_Sts FnEN_AppPln_Mode_get(VD);


/* ============================================================ */
/* 変数宣言(extern)                                             */
/* ============================================================ */
extern EN_AppPln_Mode_Sts enAppPln_Mode_Sts;    /* 走行モード */


/* ============================================================ */
/* const変数宣言(extern)                                        */
/* ============================================================ */


/* ============================================================ */
/* 関数形式マクロ定義                                           */
/* ============================================================ */


#endif
