#if !defined(INCLUDED_app_recgwall_pac_h)
#define INCLUDED_app_recgwall_pac_h
/* ============================================================ */
/* ファイル名 : app_recgwall_pac.h                              */
/* 機能       : 壁認識(app公開)                                 */
/* ============================================================ */

/* ============================================================ */
/* インクルード                                                 */
/* ============================================================ */
/* プロジェクト共通 */
#include "prj_cmn_option.h"
#include "prj_cmn_type.h"
#include "prj_cmn_macro.h"

/* カテゴリ共通 */
#include "app_cmn_option.h"
#include "app_cmn_option_pac.h"

/* 個別 */
#include "pf_raysens_if.h"

/* 本体 */


/* ============================================================ */
/* マクロ定数定義                                               */
/* ============================================================ */


/* ============================================================ */
/* 型定義                                                       */
/* ============================================================ */
/* 壁データ */
typedef struct {
  U1 u1WallExistance;       /* 壁有無 壁無し:OFF(0) 壁あり:ON(1) */
  U1 u1WallVld;             /* 壁データ有効無効 無効:OFF(0) 有効:ON(1) */
  U2 u2SensVal;             /* センサ値 */
} ST_AppRcg_WallDat;

/* 壁情報 */
typedef struct {
  ST_AppRcg_WallDat stWallF;      /* 前壁情報 */
  ST_AppRcg_WallDat stWallR;      /* 右壁情報 */
  ST_AppRcg_WallDat stWallL;      /* 左壁情報 */
} ST_AppRcg_WallInfo;


/* ============================================================ */
/* 関数プロトタイプ宣言(extern)                                 */
/* ============================================================ */


/* ============================================================ */
/* 変数宣言(extern)                                             */
/* ============================================================ */
extern ST_AppRcg_WallInfo stAppRcg_WallInfoForMap;  /* 壁情報(Map) */
extern ST_AppRcg_WallInfo stAppRcg_WallInfoForCtrl; /* 壁情報(姿勢制御) */


/* ============================================================ */
/* const変数宣言(extern)                                        */
/* ============================================================ */


/* ============================================================ */
/* 関数形式マクロ定義                                           */
/* ============================================================ */


#endif
