#if !defined(INCLUDED_app_controll_pac_h)
#define INCLUDED_app_controll_pac_h
/* ============================================================ */
/* ファイル名 : app_controll_pac.h                               */
/* 機能       :                                                 */
/* ============================================================ */

/* ============================================================ */
/* インクルード                                                 */
/* ============================================================ */
/* プロジェクト共通 */
#include "prj_cmn_option.h"
#include "prj_cmn_type.h"
#include "prj_cmn_macro.h"

/* カテゴリ共通 */
#include "app_cmn_option.h"
#include "app_cmn_option_pac.h"

/* 個別 */
#include "app_map_pac.h"

/* 本体 */


/* ============================================================ */
/* マクロ定数定義                                               */
/* ============================================================ */


/* ============================================================ */
/* 型定義                                                       */
/* ============================================================ */
/* 自分から見た方向を示す列挙型 */
typedef enum {
  CEN_AppCtrl_DirFront = 0, /* #0:前 */
  CEN_AppCtrl_DirRight,     /* #1:右 */
  CEN_AppCtrl_DirRear,      /* #2:後 */
  CEN_AppCtrl_DirLeft,      /* #3:左 */
  CEN_AppCtrl_DirUnknown    /* #4:方向不明 */
} EN_AppCtrl_Dir;

typedef enum {
  CEN_AppCtrl_RunStsRunning = 0,
  CEN_AppCtrl_RunStsFinish,
  CEN_AppCtrl_RunStsReady
} EN_AppCtrl_RunSts;


/* ============================================================ */
/* 関数プロトタイプ宣言(extern)                                 */
/* ============================================================ */
EN_AppCtrl_RunSts * FnEN_AppCtrl_getRunStt(EN_AppCtrl_Dir * tpenDir);


/* ============================================================ */
/* 変数宣言(extern)                                             */
/* ============================================================ */


/* ============================================================ */
/* const変数宣言(extern)                                        */
/* ============================================================ */


/* ============================================================ */
/* 関数形式マクロ定義                                           */
/* ============================================================ */


#endif
