#if !defined(INCLUDED_app_recgwall_pac_h)
#define INCLUDED_app_recgwall_pac_h
/* ============================================================ */
/* ファイル名 : app_recgwall_pac.h                        */
/* 機能       : 壁認識(app公開)                                 */
/* ============================================================ */

/* ============================================================ */
/* インクルード                                                 */
/* ============================================================ */
/* プロジェクト共通 */
#include "prj_cmn_option.h"
#include "prj_cmn_type.h"
#include "prj_cmn_macro.h"

/* カテゴリ共通 */
#include "app_cmn_option.h"
#include "app_cmn_option_pac.h"

/* 個別 */
#include "pf_raysens_if.h"

/* 本体 */


/* ============================================================ */
/* マクロ定数定義                                               */
/* ============================================================ */


/* ============================================================ */
/* 型定義                                                       */
/* ============================================================ */
/* 壁データ */
typedef struct {
  BL  bl_wall_with;          /* 壁有無 壁無し:OFF(0) 壁あり:ON(1) */
  BL  bl_wall_data_valid;    /* 壁データ有効無効 無効:OFF(0) 有効:ON(1) */
} ST_WALLDATA;

/* 壁情報 */
typedef struct {
  ST_WALLDATA  wall_f;      /* 前壁情報 */
  ST_WALLDATA  wall_r;      /* 右壁情報 */
  ST_WALLDATA  wall_l;      /* 左壁情報 */
} ST_WALLINFO;


/* ============================================================ */
/* 関数プロトタイプ宣言(extern)                                 */
/* ============================================================ */
extern VD FnVD_Recg_WallRecognize(VD);
extern VD FnVD_Recg_RecognizeInit(VD);


/* ============================================================ */
/* 変数宣言(extern)                                             */
/* ============================================================ */
extern ST_WALLINFO st_RecgWall_info; /* 壁情報 */


/* ============================================================ */
/* const変数宣言(extern)                                        */
/* ============================================================ */


/* ============================================================ */
/* 関数形式マクロ定義                                           */
/* ============================================================ */
/* ============================================================ */
/* 関数名 : McU1_XxYyy_getSignal                                */
/*          関数和名をここへ記述                                */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : 関数箱型コメントの形式を示す                        */
/* 制約   : なし                                                */
/* ============================================================ */


#endif
