/* ============================================================ */
/* ファイル名 : hw_drv_bat.c                                    */
/* 機能       : バッテリー処理                                  */
/* ============================================================ */
#define SECTION_HW

/* ============================================================ */
/* インクルード                                                 */
/* ============================================================ */
/* プロジェクト共通 */
#include "prj_cmn_section.h"
#include "prj_cmn_option.h"
#include "prj_cmn_type.h"
#include "prj_cmn_macro.h"

/* カテゴリ共通 */
#include "hw_cmn_option.h"
#include "hw_cmn_option_pac.h"

/* 個別 */
#include "hw_srv_interrupt.h"
#include "hw_pph_port_pac.h"
#include "hw_pph_port_cfg_pac.h"
#include "hw_pph_adc_pac.h"

/* 本体 */
#include "hw_drv_bat.h"
#include "hw_drv_bat_pac.h"


/* ============================================================ */
/* マクロ定数定義                                               */
/* ============================================================ */
/* コンフィグレーション */
#define CST_HwDrv_Bat_Port_CfgLed0   CST_HwPph_Port_CfgPB1
#define CST_HwDrv_Bat_Port_CfgLed1   CST_HwPph_Port_CfgPA3
#define CST_HwDrv_Bat_Port_CfgAdc    CST_HwPph_Port_CfgPE0

/* ポート識番号 */
#define CEN_HwDrv_Bat_Port_IdLed0    CEN_HwPph_Port_Id_PB1
#define CEN_HwDrv_Bat_Port_IdLed1    CEN_HwPph_Port_Id_PA3

/* A/D変換チャネル番号 */
#define CEN_HwDrv_Bat_Adc_Ch         CEN_HwPph_Adc_Ch_08


/* ============================================================ */
/* 型定義                                                       */
/* ============================================================ */


/* ============================================================ */
/* 関数プロトタイプ宣言(static)                                 */
/* ============================================================ */
static VD FnVD_HwDrv_Bat_clrVal(VD);


/* ============================================================ */
/* 変数定義(extern)                                             */
/* ============================================================ */


/* ============================================================ */
/* 変数定義(static)                                             */
/* ============================================================ */
static U2 u2HwDrv_Bat_Val;


/* ============================================================ */
/* const変数定義(extern)                                        */
/* ============================================================ */


/* ============================================================ */
/* const変数定義(static)                                        */
/* ============================================================ */


/* ============================================================ */
/* 関数形式マクロ定義                                           */
/* ============================================================ */


/* ============================================================ */
/* 関数定義                                                     */
/* ============================================================ */
/* ============================================================ */
/* 関数名 : FnVD_HwDrv_Bat_clrVal                               */
/*          バッテリー電圧値クリア                              */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : バッテリー電圧値をクリアする                        */
/* 制約   : 割り込み禁止中に実行すること                        */
/* ============================================================ */
static VD FnVD_HwDrv_Bat_clrVal(VD)
{
  u2HwDrv_Bat_Val = (U2)0;
}


/* ============================================================ */
/* 関数名 : FnVD_HwDrv_Bat_init                                 */
/*          バッテリー処理初期化                                */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : 初期化する                                          */
/* 制約   : 割り込み禁止中に実行すること                        */
/* ============================================================ */
VD FnVD_HwDrv_Bat_init(VD)
{
  /* バッテリー監視用LEDポート初期化 */
  /* BLED0:バッテリ監視用LED0 */
  FnVD_HwPph_Port_cfg(&CST_HwDrv_Bat_Port_CfgLed0);

  /* BLED1:バッテリ監視用LED1 */
  FnVD_HwPph_Port_cfg(&CST_HwDrv_Bat_Port_CfgLed1);

  /* アナログ入力端子ポート初期化 */
  /* AN0:電圧監視 */
  FnVD_HwPph_Port_cfg(&CST_HwDrv_Bat_Port_CfgAdc);

  /* バッテリー電圧値クリア */
  FnVD_HwDrv_Bat_clrVal();
}


/* ============================================================ */
/* 関数名 : FnVD_HwDrv_Bat_renewVal                             */
/*          バッテリー電圧値更新                                */
/* 引数   : なし                                                */
/* 戻り値 : なし                                                */
/* 概要   : A/D変換を行いバッテリー電圧値を更新する             */
/* 制約   : 割り込み禁止が解除される                            */
/* ============================================================ */
VD FnVD_HwDrv_Bat_renewVal(VD)
{
  EN_HwPph_Adc_Ch  tenAdcCh;
  EN_HwPph_Adc_Sts tenAdcSts;
  U4               tu4Set;

  tenAdcCh = CEN_HwDrv_Bat_Adc_Ch;

  /* 割り込み禁止 */
  DI();

  /* A/D変換対象設定 */
  tu4Set = (U4)((U4)1 << (U4)tenAdcCh);
  FnVD_HwPph_Adc_selTargetCh(tu4Set, (U4)~tu4Set);

  /* A/D変換開始 */
  FnVD_HwPph_Adc_start();

  /* A/D変換待ち */ /* ToDo:タイムアウト時間を設定すること */
  do {
    tenAdcSts = FnEN_HwPph_Adc_getSts();
  } while (tenAdcSts == CEN_HwPph_Adc_Sts_Run);

  /* A/D変換結果更新 */
  FnVD_HwPph_Adc_renewBuf();

  /* A/D変換結果取得 */
  u2HwDrv_Bat_Val = FnU2_HwPph_Adc_getVal(tenAdcCh);

  /* 割り込み許可 */
  EI();
}


/* ============================================================ */
/* 関数名 : FnU2_HwDrv_Bat_getVal                               */
/*          バッテリー電圧値取得                                */
/* 引数   : なし                                                */
/* 戻り値 : バッテリー電圧値                                    */
/* 概要   : バッテリー電圧値を提供する                          */
/* 制約   : なし                                                */
/* ============================================================ */
U2 FnU2_HwDrv_Bat_getVal(VD)
{
  return (u2HwDrv_Bat_Val);
}


/* ============================================================ */
/* 関数名 : FnVD_HwDrv_Bat_setReqLed0                           */
/*          バッテリー監視用LED0消灯/点灯要求設定               */
/* 引数   : tu1Req  (0:消灯, 1:点灯)                            */
/* 戻り値 : なし                                                */
/* 概要   : バッテリー監視用LEDを点灯/消灯させる                */
/* 制約   : 割り込み禁止が解除される                            */
/* ============================================================ */
VD FnVD_HwDrv_Bat_setReqLed0(U1 tu1Req)
{
  DI();
  FnVD_HwPph_Port_setOutLv(CEN_HwDrv_Bat_Port_IdLed0, tu1Req);
  EI();
}


/* ============================================================ */
/* 関数名 : FnVD_HwDrv_Bat_setReqLed1                           */
/*          バッテリー監視用LED1消灯/点灯要求設定               */
/* 引数   : tu1Req  (0:消灯, 1:点灯)                            */
/* 戻り値 : なし                                                */
/* 概要   : バッテリー監視用LEDを点灯/消灯させる                */
/* 制約   : 割り込み禁止が解除される                            */
/* ============================================================ */
VD FnVD_HwDrv_Bat_setReqLed1(U1 tu1Req)
{
  DI();
  FnVD_HwPph_Port_setOutLv(CEN_HwDrv_Bat_Port_IdLed1, tu1Req);
  EI();
}


